PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_socmem.h
/* SOCMEM_SRAM_MPC.CFG */
#define SOCMEM_SRAM_MPC_CFG_RESPONSE_Pos        4UL
#define SOCMEM_SRAM_MPC_CFG_RESPONSE_Msk        0x10UL
/* SOCMEM_SRAM_MPC.CTRL */
#define SOCMEM_SRAM_MPC_CTRL_AUTO_INC_Pos       8UL
#define SOCMEM_SRAM_MPC_CTRL_AUTO_INC_Msk       0x100UL
#define SOCMEM_SRAM_MPC_CTRL_LOCK_Pos           31UL
#define SOCMEM_SRAM_MPC_CTRL_LOCK_Msk           0x80000000UL
/* SOCMEM_SRAM_MPC.BLK_MAX */
#define SOCMEM_SRAM_MPC_BLK_MAX_VALUE_Pos       0UL
#define SOCMEM_SRAM_MPC_BLK_MAX_VALUE_Msk       0xFFFFFFFFUL
/* SOCMEM_SRAM_MPC.BLK_CFG */
#define SOCMEM_SRAM_MPC_BLK_CFG_BLOCK_SIZE_Pos  0UL
#define SOCMEM_SRAM_MPC_BLK_CFG_BLOCK_SIZE_Msk  0xFUL
#define SOCMEM_SRAM_MPC_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SOCMEM_SRAM_MPC_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SOCMEM_SRAM_MPC.BLK_IDX */
#define SOCMEM_SRAM_MPC_BLK_IDX_VALUE_Pos       0UL
#define SOCMEM_SRAM_MPC_BLK_IDX_VALUE_Msk       0xFFFFFFFFUL
/* SOCMEM_SRAM_MPC.BLK_LUT */
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS0_Pos    0UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS0_Msk    0x1UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS1_Pos    1UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS1_Msk    0x2UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS2_Pos    2UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS2_Msk    0x4UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS3_Pos    3UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS3_Msk    0x8UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS4_Pos    4UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS4_Msk    0x10UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS5_Pos    5UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS5_Msk    0x20UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS6_Pos    6UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS6_Msk    0x40UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS7_Pos    7UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS7_Msk    0x80UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS8_Pos    8UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS8_Msk    0x100UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS9_Pos    9UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS9_Msk    0x200UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS10_Pos   10UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS10_Msk   0x400UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS11_Pos   11UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS11_Msk   0x800UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS12_Pos   12UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS12_Msk   0x1000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS13_Pos   13UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS13_Msk   0x2000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS14_Pos   14UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS14_Msk   0x4000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS15_Pos   15UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS15_Msk   0x8000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS16_Pos   16UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS16_Msk   0x10000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS17_Pos   17UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS17_Msk   0x20000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS18_Pos   18UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS18_Msk   0x40000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS19_Pos   19UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS19_Msk   0x80000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS20_Pos   20UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS20_Msk   0x100000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS21_Pos   21UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS21_Msk   0x200000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS22_Pos   22UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS22_Msk   0x400000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS23_Pos   23UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS23_Msk   0x800000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS24_Pos   24UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS24_Msk   0x1000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS25_Pos   25UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS25_Msk   0x2000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS26_Pos   26UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS26_Msk   0x4000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS27_Pos   27UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS27_Msk   0x8000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS28_Pos   28UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS28_Msk   0x10000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS29_Pos   29UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS29_Msk   0x20000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS30_Pos   30UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS30_Msk   0x40000000UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS31_Pos   31UL
#define SOCMEM_SRAM_MPC_BLK_LUT_ATTR_NS31_Msk   0x80000000UL
/* SOCMEM_SRAM_MPC.ROT_CTRL */
#define SOCMEM_SRAM_MPC_ROT_CTRL_AUTO_INC_Pos   8UL
#define SOCMEM_SRAM_MPC_ROT_CTRL_AUTO_INC_Msk   0x100UL
#define SOCMEM_SRAM_MPC_ROT_CTRL_LOCK_Pos       31UL
#define SOCMEM_SRAM_MPC_ROT_CTRL_LOCK_Msk       0x80000000UL
/* SOCMEM_SRAM_MPC.ROT_BLK_MAX */
#define SOCMEM_SRAM_MPC_ROT_BLK_MAX_VALUE_Pos   0UL
#define SOCMEM_SRAM_MPC_ROT_BLK_MAX_VALUE_Msk   0xFFFFFFFFUL
/* SOCMEM_SRAM_MPC.ROT_BLK_CFG */
#define SOCMEM_SRAM_MPC_ROT_BLK_CFG_BLOCK_SIZE_Pos 0UL
#define SOCMEM_SRAM_MPC_ROT_BLK_CFG_BLOCK_SIZE_Msk 0xFUL
#define SOCMEM_SRAM_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SOCMEM_SRAM_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SOCMEM_SRAM_MPC.ROT_BLK_IDX */
#define SOCMEM_SRAM_MPC_ROT_BLK_IDX_VALUE_Pos   0UL
#define SOCMEM_SRAM_MPC_ROT_BLK_IDX_VALUE_Msk   0xFFFFFFFFUL
/* SOCMEM_SRAM_MPC.ROT_BLK_PC */
#define SOCMEM_SRAM_MPC_ROT_BLK_PC_PC_Pos       0UL
#define SOCMEM_SRAM_MPC_ROT_BLK_PC_PC_Msk       0xFUL
/* SOCMEM_SRAM_MPC.ROT_BLK_LUT */
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR0_Pos   0UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR0_Msk   0x7UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR1_Pos   4UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR1_Msk   0x70UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR2_Pos   8UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR2_Msk   0x700UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR3_Pos   12UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR3_Msk   0x7000UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR4_Pos   16UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR4_Msk   0x70000UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR5_Pos   20UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR5_Msk   0x700000UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR6_Pos   24UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR6_Msk   0x7000000UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR7_Pos   28UL
#define SOCMEM_SRAM_MPC_ROT_BLK_LUT_ATTR7_Msk   0x70000000UL


