PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_socmem.h
/* SOCMEM_SROM_MPC.CFG */
#define SOCMEM_SROM_MPC_CFG_RESPONSE_Pos        4UL
#define SOCMEM_SROM_MPC_CFG_RESPONSE_Msk        0x10UL
/* SOCMEM_SROM_MPC.CTRL */
#define SOCMEM_SROM_MPC_CTRL_AUTO_INC_Pos       8UL
#define SOCMEM_SROM_MPC_CTRL_AUTO_INC_Msk       0x100UL
#define SOCMEM_SROM_MPC_CTRL_LOCK_Pos           31UL
#define SOCMEM_SROM_MPC_CTRL_LOCK_Msk           0x80000000UL
/* SOCMEM_SROM_MPC.BLK_MAX */
#define SOCMEM_SROM_MPC_BLK_MAX_VALUE_Pos       0UL
#define SOCMEM_SROM_MPC_BLK_MAX_VALUE_Msk       0xFFFFFFFFUL
/* SOCMEM_SROM_MPC.BLK_CFG */
#define SOCMEM_SROM_MPC_BLK_CFG_BLOCK_SIZE_Pos  0UL
#define SOCMEM_SROM_MPC_BLK_CFG_BLOCK_SIZE_Msk  0xFUL
#define SOCMEM_SROM_MPC_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SOCMEM_SROM_MPC_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SOCMEM_SROM_MPC.BLK_IDX */
#define SOCMEM_SROM_MPC_BLK_IDX_VALUE_Pos       0UL
#define SOCMEM_SROM_MPC_BLK_IDX_VALUE_Msk       0xFFFFFFFFUL
/* SOCMEM_SROM_MPC.BLK_LUT */
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS0_Pos    0UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS0_Msk    0x1UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS1_Pos    1UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS1_Msk    0x2UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS2_Pos    2UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS2_Msk    0x4UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS3_Pos    3UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS3_Msk    0x8UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS4_Pos    4UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS4_Msk    0x10UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS5_Pos    5UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS5_Msk    0x20UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS6_Pos    6UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS6_Msk    0x40UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS7_Pos    7UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS7_Msk    0x80UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS8_Pos    8UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS8_Msk    0x100UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS9_Pos    9UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS9_Msk    0x200UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS10_Pos   10UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS10_Msk   0x400UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS11_Pos   11UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS11_Msk   0x800UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS12_Pos   12UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS12_Msk   0x1000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS13_Pos   13UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS13_Msk   0x2000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS14_Pos   14UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS14_Msk   0x4000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS15_Pos   15UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS15_Msk   0x8000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS16_Pos   16UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS16_Msk   0x10000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS17_Pos   17UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS17_Msk   0x20000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS18_Pos   18UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS18_Msk   0x40000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS19_Pos   19UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS19_Msk   0x80000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS20_Pos   20UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS20_Msk   0x100000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS21_Pos   21UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS21_Msk   0x200000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS22_Pos   22UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS22_Msk   0x400000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS23_Pos   23UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS23_Msk   0x800000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS24_Pos   24UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS24_Msk   0x1000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS25_Pos   25UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS25_Msk   0x2000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS26_Pos   26UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS26_Msk   0x4000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS27_Pos   27UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS27_Msk   0x8000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS28_Pos   28UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS28_Msk   0x10000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS29_Pos   29UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS29_Msk   0x20000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS30_Pos   30UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS30_Msk   0x40000000UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS31_Pos   31UL
#define SOCMEM_SROM_MPC_BLK_LUT_ATTR_NS31_Msk   0x80000000UL
/* SOCMEM_SROM_MPC.ROT_CTRL */
#define SOCMEM_SROM_MPC_ROT_CTRL_AUTO_INC_Pos   8UL
#define SOCMEM_SROM_MPC_ROT_CTRL_AUTO_INC_Msk   0x100UL
#define SOCMEM_SROM_MPC_ROT_CTRL_LOCK_Pos       31UL
#define SOCMEM_SROM_MPC_ROT_CTRL_LOCK_Msk       0x80000000UL
/* SOCMEM_SROM_MPC.ROT_BLK_MAX */
#define SOCMEM_SROM_MPC_ROT_BLK_MAX_VALUE_Pos   0UL
#define SOCMEM_SROM_MPC_ROT_BLK_MAX_VALUE_Msk   0xFFFFFFFFUL
/* SOCMEM_SROM_MPC.ROT_BLK_CFG */
#define SOCMEM_SROM_MPC_ROT_BLK_CFG_BLOCK_SIZE_Pos 0UL
#define SOCMEM_SROM_MPC_ROT_BLK_CFG_BLOCK_SIZE_Msk 0xFUL
#define SOCMEM_SROM_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Pos 31UL
#define SOCMEM_SROM_MPC_ROT_BLK_CFG_INIT_IN_PROGRESS_Msk 0x80000000UL
/* SOCMEM_SROM_MPC.ROT_BLK_IDX */
#define SOCMEM_SROM_MPC_ROT_BLK_IDX_VALUE_Pos   0UL
#define SOCMEM_SROM_MPC_ROT_BLK_IDX_VALUE_Msk   0xFFFFFFFFUL
/* SOCMEM_SROM_MPC.ROT_BLK_PC */
#define SOCMEM_SROM_MPC_ROT_BLK_PC_PC_Pos       0UL
#define SOCMEM_SROM_MPC_ROT_BLK_PC_PC_Msk       0xFUL
/* SOCMEM_SROM_MPC.ROT_BLK_LUT */
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR0_Pos   0UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR0_Msk   0x7UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR1_Pos   4UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR1_Msk   0x70UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR2_Pos   8UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR2_Msk   0x700UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR3_Pos   12UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR3_Msk   0x7000UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR4_Pos   16UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR4_Msk   0x70000UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR5_Pos   20UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR5_Msk   0x700000UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR6_Pos   24UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR6_Msk   0x7000000UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR7_Pos   28UL
#define SOCMEM_SROM_MPC_ROT_BLK_LUT_ATTR7_Msk   0x70000000UL


/* SOCMEM_PORT_STRUCT.PATCH_CTL */
#define SOCMEM_PORT_STRUCT_PATCH_CTL_ENABLED_Pos 31UL
#define SOCMEM_PORT_STRUCT_PATCH_CTL_ENABLED_Msk 0x80000000UL
/* SOCMEM_PORT_STRUCT.PATCH_STATUS */
#define SOCMEM_PORT_STRUCT_PATCH_STATUS_PATCH_IDX_Pos 0UL
#define SOCMEM_PORT_STRUCT_PATCH_STATUS_PATCH_IDX_Msk 0x1FFUL
#define SOCMEM_PORT_STRUCT_PATCH_STATUS_PATCH_VALID_Pos 31UL
#define SOCMEM_PORT_STRUCT_PATCH_STATUS_PATCH_VALID_Msk 0x80000000UL
/* SOCMEM_PORT_STRUCT.PATCH_SROM */
#define SOCMEM_PORT_STRUCT_PATCH_SROM_BOUNDARY_Pos 0UL
#define SOCMEM_PORT_STRUCT_PATCH_SROM_BOUNDARY_Msk 0xFFFFFFFFUL
/* SOCMEM_PORT_STRUCT.PATCH_SRAM */
#define SOCMEM_PORT_STRUCT_PATCH_SRAM_ADDR_Pos  0UL
#define SOCMEM_PORT_STRUCT_PATCH_SRAM_ADDR_Msk  0xFFFFFFFFUL
/* SOCMEM_PORT_STRUCT.PATCH_CFG */
#define SOCMEM_PORT_STRUCT_PATCH_CFG_PATCH_NR_Pos 0UL
#define SOCMEM_PORT_STRUCT_PATCH_CFG_PATCH_NR_Msk 0x3FFUL
#define SOCMEM_PORT_STRUCT_PATCH_CFG_PATCH_SIZE_Pos 16UL
#define SOCMEM_PORT_STRUCT_PATCH_CFG_PATCH_SIZE_Msk 0x30000UL
/* SOCMEM_PORT_STRUCT.PATCH_STRUCT_CTL */
#define SOCMEM_PORT_STRUCT_PATCH_STRUCT_CTL_VALID_Pos 0UL
#define SOCMEM_PORT_STRUCT_PATCH_STRUCT_CTL_VALID_Msk 0x1UL
#define SOCMEM_PORT_STRUCT_PATCH_STRUCT_CTL_MATCH_ADDR_Pos 3UL
#define SOCMEM_PORT_STRUCT_PATCH_STRUCT_CTL_MATCH_ADDR_Msk 0xFFFFFFF8UL


/* SOCMEM_PPU_SOCMEM.PWPR */
#define SOCMEM_PPU_SOCMEM_PWPR_PWR_POLICY_Pos   0UL
#define SOCMEM_PPU_SOCMEM_PWPR_PWR_POLICY_Msk   0xFUL
#define SOCMEM_PPU_SOCMEM_PWPR_PWR_DYN_EN_Pos   8UL
#define SOCMEM_PPU_SOCMEM_PWPR_PWR_DYN_EN_Msk   0x100UL
#define SOCMEM_PPU_SOCMEM_PWPR_LOCK_EN_Pos      12UL
#define SOCMEM_PPU_SOCMEM_PWPR_LOCK_EN_Msk      0x1000UL
#define SOCMEM_PPU_SOCMEM_PWPR_OP_POLICY_Pos    16UL
#define SOCMEM_PPU_SOCMEM_PWPR_OP_POLICY_Msk    0xF0000UL
#define SOCMEM_PPU_SOCMEM_PWPR_OP_DYN_EN_Pos    24UL
#define SOCMEM_PPU_SOCMEM_PWPR_OP_DYN_EN_Msk    0x1000000UL
/* SOCMEM_PPU_SOCMEM.PMER */
#define SOCMEM_PPU_SOCMEM_PMER_EMU_EN_Pos       0UL
#define SOCMEM_PPU_SOCMEM_PMER_EMU_EN_Msk       0x1UL
/* SOCMEM_PPU_SOCMEM.PWSR */
#define SOCMEM_PPU_SOCMEM_PWSR_PWR_STATUS_Pos   0UL
#define SOCMEM_PPU_SOCMEM_PWSR_PWR_STATUS_Msk   0xFUL
#define SOCMEM_PPU_SOCMEM_PWSR_PWR_DYN_STATUS_Pos 8UL
#define SOCMEM_PPU_SOCMEM_PWSR_PWR_DYN_STATUS_Msk 0x100UL
#define SOCMEM_PPU_SOCMEM_PWSR_LOCK_STATUS_Pos  12UL
#define SOCMEM_PPU_SOCMEM_PWSR_LOCK_STATUS_Msk  0x1000UL
#define SOCMEM_PPU_SOCMEM_PWSR_OP_STATUS_Pos    16UL
#define SOCMEM_PPU_SOCMEM_PWSR_OP_STATUS_Msk    0xF0000UL
#define SOCMEM_PPU_SOCMEM_PWSR_OP_DYN_STATUS_Pos 24UL
#define SOCMEM_PPU_SOCMEM_PWSR_OP_DYN_STATUS_Msk 0x1000000UL
/* SOCMEM_PPU_SOCMEM.DISR */
#define SOCMEM_PPU_SOCMEM_DISR_PWR_DEVACTIVE_STATUS_Pos 0UL
#define SOCMEM_PPU_SOCMEM_DISR_PWR_DEVACTIVE_STATUS_Msk 0x7FFUL
#define SOCMEM_PPU_SOCMEM_DISR_OP_DEVACTIVE_STATUS_Pos 24UL
#define SOCMEM_PPU_SOCMEM_DISR_OP_DEVACTIVE_STATUS_Msk 0xFF000000UL
/* SOCMEM_PPU_SOCMEM.MISR */
#define SOCMEM_PPU_SOCMEM_MISR_PCSMPACCEPT_STATUS_Pos 0UL
#define SOCMEM_PPU_SOCMEM_MISR_PCSMPACCEPT_STATUS_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_MISR_DEVACCEPT_STATUS_Pos 8UL
#define SOCMEM_PPU_SOCMEM_MISR_DEVACCEPT_STATUS_Msk 0xFF00UL
#define SOCMEM_PPU_SOCMEM_MISR_DEVDENY_STATUS_Pos 16UL
#define SOCMEM_PPU_SOCMEM_MISR_DEVDENY_STATUS_Msk 0xFF0000UL
/* SOCMEM_PPU_SOCMEM.STSR */
#define SOCMEM_PPU_SOCMEM_STSR_STORED_DEVDENY_Pos 0UL
#define SOCMEM_PPU_SOCMEM_STSR_STORED_DEVDENY_Msk 0xFFUL
/* SOCMEM_PPU_SOCMEM.UNLK */
#define SOCMEM_PPU_SOCMEM_UNLK_UNLOCK_Pos       0UL
#define SOCMEM_PPU_SOCMEM_UNLK_UNLOCK_Msk       0x1UL
/* SOCMEM_PPU_SOCMEM.PWCR */
#define SOCMEM_PPU_SOCMEM_PWCR_DEVREQEN_Pos     0UL
#define SOCMEM_PPU_SOCMEM_PWCR_DEVREQEN_Msk     0xFFUL
#define SOCMEM_PPU_SOCMEM_PWCR_PWR_DEVACTIVEEN_Pos 8UL
#define SOCMEM_PPU_SOCMEM_PWCR_PWR_DEVACTIVEEN_Msk 0x7FF00UL
#define SOCMEM_PPU_SOCMEM_PWCR_OP_DEVACTIVEEN_Pos 24UL
#define SOCMEM_PPU_SOCMEM_PWCR_OP_DEVACTIVEEN_Msk 0xFF000000UL
/* SOCMEM_PPU_SOCMEM.PTCR */
#define SOCMEM_PPU_SOCMEM_PTCR_WARM_RST_DEVREQEN_Pos 0UL
#define SOCMEM_PPU_SOCMEM_PTCR_WARM_RST_DEVREQEN_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_PTCR_DBG_RECOV_PORST_EN_Pos 1UL
#define SOCMEM_PPU_SOCMEM_PTCR_DBG_RECOV_PORST_EN_Msk 0x2UL
/* SOCMEM_PPU_SOCMEM.IMR */
#define SOCMEM_PPU_SOCMEM_IMR_STA_POLICY_TRN_IRQ_MASK_Pos 0UL
#define SOCMEM_PPU_SOCMEM_IMR_STA_POLICY_TRN_IRQ_MASK_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_IMR_STA_ACCEPT_IRQ_MASK_Pos 1UL
#define SOCMEM_PPU_SOCMEM_IMR_STA_ACCEPT_IRQ_MASK_Msk 0x2UL
#define SOCMEM_PPU_SOCMEM_IMR_STA_DENY_IRQ_MASK_Pos 2UL
#define SOCMEM_PPU_SOCMEM_IMR_STA_DENY_IRQ_MASK_Msk 0x4UL
#define SOCMEM_PPU_SOCMEM_IMR_EMU_ACCEPT_IRQ_MASK_Pos 3UL
#define SOCMEM_PPU_SOCMEM_IMR_EMU_ACCEPT_IRQ_MASK_Msk 0x8UL
#define SOCMEM_PPU_SOCMEM_IMR_EMU_DENY_IRQ_MASK_Pos 4UL
#define SOCMEM_PPU_SOCMEM_IMR_EMU_DENY_IRQ_MASK_Msk 0x10UL
#define SOCMEM_PPU_SOCMEM_IMR_LOCKED_IRQ_MASK_Pos 5UL
#define SOCMEM_PPU_SOCMEM_IMR_LOCKED_IRQ_MASK_Msk 0x20UL
/* SOCMEM_PPU_SOCMEM.AIMR */
#define SOCMEM_PPU_SOCMEM_AIMR_UNSPT_POLICY_IRQ_MASK_Pos 0UL
#define SOCMEM_PPU_SOCMEM_AIMR_UNSPT_POLICY_IRQ_MASK_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_AIMR_DYN_ACCEPT_IRQ_MASK_Pos 1UL
#define SOCMEM_PPU_SOCMEM_AIMR_DYN_ACCEPT_IRQ_MASK_Msk 0x2UL
#define SOCMEM_PPU_SOCMEM_AIMR_DYN_DENY_IRQ_MASK_Pos 2UL
#define SOCMEM_PPU_SOCMEM_AIMR_DYN_DENY_IRQ_MASK_Msk 0x4UL
#define SOCMEM_PPU_SOCMEM_AIMR_STA_POLICY_PWR_IRQ_MASK_Pos 3UL
#define SOCMEM_PPU_SOCMEM_AIMR_STA_POLICY_PWR_IRQ_MASK_Msk 0x8UL
#define SOCMEM_PPU_SOCMEM_AIMR_STA_POLICY_OP_IRQ_MASK_Pos 4UL
#define SOCMEM_PPU_SOCMEM_AIMR_STA_POLICY_OP_IRQ_MASK_Msk 0x10UL
/* SOCMEM_PPU_SOCMEM.ISR */
#define SOCMEM_PPU_SOCMEM_ISR_STA_POLICY_TRN_IRQ_Pos 0UL
#define SOCMEM_PPU_SOCMEM_ISR_STA_POLICY_TRN_IRQ_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_ISR_STA_ACCEPT_IRQ_Pos 1UL
#define SOCMEM_PPU_SOCMEM_ISR_STA_ACCEPT_IRQ_Msk 0x2UL
#define SOCMEM_PPU_SOCMEM_ISR_STA_DENY_IRQ_Pos  2UL
#define SOCMEM_PPU_SOCMEM_ISR_STA_DENY_IRQ_Msk  0x4UL
#define SOCMEM_PPU_SOCMEM_ISR_EMU_ACCEPT_IRQ_Pos 3UL
#define SOCMEM_PPU_SOCMEM_ISR_EMU_ACCEPT_IRQ_Msk 0x8UL
#define SOCMEM_PPU_SOCMEM_ISR_EMU_DENY_IRQ_Pos  4UL
#define SOCMEM_PPU_SOCMEM_ISR_EMU_DENY_IRQ_Msk  0x10UL
#define SOCMEM_PPU_SOCMEM_ISR_LOCKED_IRQ_Pos    5UL
#define SOCMEM_PPU_SOCMEM_ISR_LOCKED_IRQ_Msk    0x20UL
#define SOCMEM_PPU_SOCMEM_ISR_OTHER_IRQ_Pos     7UL
#define SOCMEM_PPU_SOCMEM_ISR_OTHER_IRQ_Msk     0x80UL
#define SOCMEM_PPU_SOCMEM_ISR_PWR_ACTIVE_EDGE_IRQ_Pos 8UL
#define SOCMEM_PPU_SOCMEM_ISR_PWR_ACTIVE_EDGE_IRQ_Msk 0x7FF00UL
#define SOCMEM_PPU_SOCMEM_ISR_OP_ACTIVE_EDGE_IRQ_Pos 24UL
#define SOCMEM_PPU_SOCMEM_ISR_OP_ACTIVE_EDGE_IRQ_Msk 0xFF000000UL
/* SOCMEM_PPU_SOCMEM.AISR */
#define SOCMEM_PPU_SOCMEM_AISR_UNSPT_POLICY_IRQ_Pos 0UL
#define SOCMEM_PPU_SOCMEM_AISR_UNSPT_POLICY_IRQ_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_AISR_DYN_ACCEPT_IRQ_Pos 1UL
#define SOCMEM_PPU_SOCMEM_AISR_DYN_ACCEPT_IRQ_Msk 0x2UL
#define SOCMEM_PPU_SOCMEM_AISR_DYN_DENY_IRQ_Pos 2UL
#define SOCMEM_PPU_SOCMEM_AISR_DYN_DENY_IRQ_Msk 0x4UL
#define SOCMEM_PPU_SOCMEM_AISR_STA_POLICY_PWR_IRQ_Pos 3UL
#define SOCMEM_PPU_SOCMEM_AISR_STA_POLICY_PWR_IRQ_Msk 0x8UL
#define SOCMEM_PPU_SOCMEM_AISR_STA_POLICY_OP_IRQ_Pos 4UL
#define SOCMEM_PPU_SOCMEM_AISR_STA_POLICY_OP_IRQ_Msk 0x10UL
/* SOCMEM_PPU_SOCMEM.IESR */
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE00_EDGE_Pos 0UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE00_EDGE_Msk 0x3UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE01_EDGE_Pos 2UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE01_EDGE_Msk 0xCUL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE02_EDGE_Pos 4UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE02_EDGE_Msk 0x30UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE03_EDGE_Pos 6UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE03_EDGE_Msk 0xC0UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE04_EDGE_Pos 8UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE04_EDGE_Msk 0x300UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE05_EDGE_Pos 10UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE05_EDGE_Msk 0xC00UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE06_EDGE_Pos 12UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE06_EDGE_Msk 0x3000UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE07_EDGE_Pos 14UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE07_EDGE_Msk 0xC000UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE08_EDGE_Pos 16UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE08_EDGE_Msk 0x30000UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE09_EDGE_Pos 18UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE09_EDGE_Msk 0xC0000UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE10_EDGE_Pos 20UL
#define SOCMEM_PPU_SOCMEM_IESR_DEVACTIVE10_EDGE_Msk 0x300000UL
/* SOCMEM_PPU_SOCMEM.OPSR */
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE16_EDGE_Pos 0UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE16_EDGE_Msk 0x3UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE17_EDGE_Pos 2UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE17_EDGE_Msk 0xCUL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE18_EDGE_Pos 4UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE18_EDGE_Msk 0x30UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE19_EDGE_Pos 6UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE19_EDGE_Msk 0xC0UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE20_EDGE_Pos 8UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE20_EDGE_Msk 0x300UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE21_EDGE_Pos 10UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE21_EDGE_Msk 0xC00UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE22_EDGE_Pos 12UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE22_EDGE_Msk 0x3000UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE23_EDGE_Pos 14UL
#define SOCMEM_PPU_SOCMEM_OPSR_DEVACTIVE23_EDGE_Msk 0xC000UL
/* SOCMEM_PPU_SOCMEM.FUNRR */
#define SOCMEM_PPU_SOCMEM_FUNRR_FUNC_RET_RAM_CFG_Pos 0UL
#define SOCMEM_PPU_SOCMEM_FUNRR_FUNC_RET_RAM_CFG_Msk 0xFFUL
/* SOCMEM_PPU_SOCMEM.FULRR */
#define SOCMEM_PPU_SOCMEM_FULRR_FULL_RET_RAM_CFG_Pos 0UL
#define SOCMEM_PPU_SOCMEM_FULRR_FULL_RET_RAM_CFG_Msk 0xFFUL
/* SOCMEM_PPU_SOCMEM.MEMRR */
#define SOCMEM_PPU_SOCMEM_MEMRR_MEM_RET_RAM_CFG_Pos 0UL
#define SOCMEM_PPU_SOCMEM_MEMRR_MEM_RET_RAM_CFG_Msk 0xFFUL
/* SOCMEM_PPU_SOCMEM.EDTR0 */
#define SOCMEM_PPU_SOCMEM_EDTR0_OFF_DEL_Pos     0UL
#define SOCMEM_PPU_SOCMEM_EDTR0_OFF_DEL_Msk     0xFFUL
#define SOCMEM_PPU_SOCMEM_EDTR0_MEM_RET_DEL_Pos 8UL
#define SOCMEM_PPU_SOCMEM_EDTR0_MEM_RET_DEL_Msk 0xFF00UL
#define SOCMEM_PPU_SOCMEM_EDTR0_LOGIC_RET_DEL_Pos 16UL
#define SOCMEM_PPU_SOCMEM_EDTR0_LOGIC_RET_DEL_Msk 0xFF0000UL
#define SOCMEM_PPU_SOCMEM_EDTR0_FULL_RET_DEL_Pos 24UL
#define SOCMEM_PPU_SOCMEM_EDTR0_FULL_RET_DEL_Msk 0xFF000000UL
/* SOCMEM_PPU_SOCMEM.EDTR1 */
#define SOCMEM_PPU_SOCMEM_EDTR1_MEM_OFF_DEL_Pos 0UL
#define SOCMEM_PPU_SOCMEM_EDTR1_MEM_OFF_DEL_Msk 0xFFUL
#define SOCMEM_PPU_SOCMEM_EDTR1_FUNC_RET_DEL_Pos 8UL
#define SOCMEM_PPU_SOCMEM_EDTR1_FUNC_RET_DEL_Msk 0xFF00UL
/* SOCMEM_PPU_SOCMEM.DCDR0 */
#define SOCMEM_PPU_SOCMEM_DCDR0_CLKEN_RST_DLY_Pos 0UL
#define SOCMEM_PPU_SOCMEM_DCDR0_CLKEN_RST_DLY_Msk 0xFFUL
#define SOCMEM_PPU_SOCMEM_DCDR0_ISO_CLKEN_DLY_Pos 8UL
#define SOCMEM_PPU_SOCMEM_DCDR0_ISO_CLKEN_DLY_Msk 0xFF00UL
#define SOCMEM_PPU_SOCMEM_DCDR0_RST_HWSTAT_DLY_Pos 16UL
#define SOCMEM_PPU_SOCMEM_DCDR0_RST_HWSTAT_DLY_Msk 0xFF0000UL
/* SOCMEM_PPU_SOCMEM.DCDR1 */
#define SOCMEM_PPU_SOCMEM_DCDR1_ISO_RST_DLY_Pos 0UL
#define SOCMEM_PPU_SOCMEM_DCDR1_ISO_RST_DLY_Msk 0xFFUL
#define SOCMEM_PPU_SOCMEM_DCDR1_CLKEN_ISO_DLY_Pos 8UL
#define SOCMEM_PPU_SOCMEM_DCDR1_CLKEN_ISO_DLY_Msk 0xFF00UL
/* SOCMEM_PPU_SOCMEM.IDR0 */
#define SOCMEM_PPU_SOCMEM_IDR0_DEVCHAN_Pos      0UL
#define SOCMEM_PPU_SOCMEM_IDR0_DEVCHAN_Msk      0xFUL
#define SOCMEM_PPU_SOCMEM_IDR0_NUM_OPMODE_Pos   4UL
#define SOCMEM_PPU_SOCMEM_IDR0_NUM_OPMODE_Msk   0xF0UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_OFF_SPT_Pos  8UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_OFF_SPT_Msk  0x100UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_OFF_EMU_SPT_Pos 9UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_OFF_EMU_SPT_Msk 0x200UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_MEM_RET_SPT_Pos 10UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_MEM_RET_SPT_Msk 0x400UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_MEM_RET_EMU_SPT_Pos 11UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_MEM_RET_EMU_SPT_Msk 0x800UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_LGC_RET_SPT_Pos 12UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_LGC_RET_SPT_Msk 0x1000UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_MEM_OFF_SPT_Pos 13UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_MEM_OFF_SPT_Msk 0x2000UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_FULL_RET_SPT_Pos 14UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_FULL_RET_SPT_Msk 0x4000UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_FUNC_RET_SPT_Pos 15UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_FUNC_RET_SPT_Msk 0x8000UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_ON_SPT_Pos   16UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_ON_SPT_Msk   0x10000UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_WRM_RST_SPT_Pos 17UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_WRM_RST_SPT_Msk 0x20000UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_DBG_RECOV_SPT_Pos 18UL
#define SOCMEM_PPU_SOCMEM_IDR0_STA_DBG_RECOV_SPT_Msk 0x40000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_OFF_SPT_Pos  20UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_OFF_SPT_Msk  0x100000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_OFF_EMU_SPT_Pos 21UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_OFF_EMU_SPT_Msk 0x200000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_MEM_RET_SPT_Pos 22UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_MEM_RET_SPT_Msk 0x400000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_MEM_RET_EMU_SPT_Pos 23UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_MEM_RET_EMU_SPT_Msk 0x800000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_LGC_RET_SPT_Pos 24UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_LGC_RET_SPT_Msk 0x1000000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_MEM_OFF_SPT_Pos 25UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_MEM_OFF_SPT_Msk 0x2000000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_FULL_RET_SPT_Pos 26UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_FULL_RET_SPT_Msk 0x4000000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_FUNC_RET_SPT_Pos 27UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_FUNC_RET_SPT_Msk 0x8000000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_ON_SPT_Pos   28UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_ON_SPT_Msk   0x10000000UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_WRM_RST_SPT_Pos 29UL
#define SOCMEM_PPU_SOCMEM_IDR0_DYN_WRM_RST_SPT_Msk 0x20000000UL
/* SOCMEM_PPU_SOCMEM.IDR1 */
#define SOCMEM_PPU_SOCMEM_IDR1_PWR_MODE_ENTRY_DEL_SPT_Pos 0UL
#define SOCMEM_PPU_SOCMEM_IDR1_PWR_MODE_ENTRY_DEL_SPT_Msk 0x1UL
#define SOCMEM_PPU_SOCMEM_IDR1_SW_DEV_DEL_SPT_Pos 1UL
#define SOCMEM_PPU_SOCMEM_IDR1_SW_DEV_DEL_SPT_Msk 0x2UL
#define SOCMEM_PPU_SOCMEM_IDR1_LOCK_SPT_Pos     2UL
#define SOCMEM_PPU_SOCMEM_IDR1_LOCK_SPT_Msk     0x4UL
#define SOCMEM_PPU_SOCMEM_IDR1_MEM_RET_RAM_REG_Pos 4UL
#define SOCMEM_PPU_SOCMEM_IDR1_MEM_RET_RAM_REG_Msk 0x10UL
#define SOCMEM_PPU_SOCMEM_IDR1_FULL_RET_RAM_REG_Pos 5UL
#define SOCMEM_PPU_SOCMEM_IDR1_FULL_RET_RAM_REG_Msk 0x20UL
#define SOCMEM_PPU_SOCMEM_IDR1_FUNC_RET_RAM_REG_Pos 6UL
#define SOCMEM_PPU_SOCMEM_IDR1_FUNC_RET_RAM_REG_Msk 0x40UL
#define SOCMEM_PPU_SOCMEM_IDR1_STA_POLICY_PWR_IRQ_SPT_Pos 8UL
#define SOCMEM_PPU_SOCMEM_IDR1_STA_POLICY_PWR_IRQ_SPT_Msk 0x100UL
#define SOCMEM_PPU_SOCMEM_IDR1_STA_POLICY_OP_IRQ_SPT_Pos 9UL
#define SOCMEM_PPU_SOCMEM_IDR1_STA_POLICY_OP_IRQ_SPT_Msk 0x200UL
#define SOCMEM_PPU_SOCMEM_IDR1_OP_ACTIVE_Pos    10UL
#define SOCMEM_PPU_SOCMEM_IDR1_OP_ACTIVE_Msk    0x400UL
#define SOCMEM_PPU_SOCMEM_IDR1_OFF_MEM_RET_TRANS_Pos 12UL
#define SOCMEM_PPU_SOCMEM_IDR1_OFF_MEM_RET_TRANS_Msk 0x1000UL
/* SOCMEM_PPU_SOCMEM.IIDR */
#define SOCMEM_PPU_SOCMEM_IIDR_IMPLEMENTER_Pos  0UL
#define SOCMEM_PPU_SOCMEM_IIDR_IMPLEMENTER_Msk  0xFFFUL
#define SOCMEM_PPU_SOCMEM_IIDR_REVISION_Pos     12UL
#define SOCMEM_PPU_SOCMEM_IIDR_REVISION_Msk     0xF000UL
#define SOCMEM_PPU_SOCMEM_IIDR_VARIANT_Pos      16UL
#define SOCMEM_PPU_SOCMEM_IIDR_VARIANT_Msk      0xF0000UL
#define SOCMEM_PPU_SOCMEM_IIDR_PRODUCT_ID_Pos   20UL
#define SOCMEM_PPU_SOCMEM_IIDR_PRODUCT_ID_Msk   0xFFF00000UL
/* SOCMEM_PPU_SOCMEM.AIDR */
#define SOCMEM_PPU_SOCMEM_AIDR_ARCH_REV_MINOR_Pos 0UL
#define SOCMEM_PPU_SOCMEM_AIDR_ARCH_REV_MINOR_Msk 0xFUL
#define SOCMEM_PPU_SOCMEM_AIDR_ARCH_REV_MAJOR_Pos 4UL
#define SOCMEM_PPU_SOCMEM_AIDR_ARCH_REV_MAJOR_Msk 0xF0UL
/* SOCMEM_PPU_SOCMEM.PID4 */
#define SOCMEM_PPU_SOCMEM_PID4_IMPLEMENTER_11_8_Pos 0UL
#define SOCMEM_PPU_SOCMEM_PID4_IMPLEMENTER_11_8_Msk 0xFUL
/* SOCMEM_PPU_SOCMEM.PID0 */
#define SOCMEM_PPU_SOCMEM_PID0_PRODUCT_ID_7_0_Pos 0UL
#define SOCMEM_PPU_SOCMEM_PID0_PRODUCT_ID_7_0_Msk 0xFFUL
/* SOCMEM_PPU_SOCMEM.PID1 */
#define SOCMEM_PPU_SOCMEM_PID1_PRODUCT_ID_11_8_Pos 0UL
#define SOCMEM_PPU_SOCMEM_PID1_PRODUCT_ID_11_8_Msk 0xFUL
#define SOCMEM_PPU_SOCMEM_PID1_IMPLEMENTER_3_0_Pos 4UL
#define SOCMEM_PPU_SOCMEM_PID1_IMPLEMENTER_3_0_Msk 0xF0UL
/* SOCMEM_PPU_SOCMEM.PID2 */
#define SOCMEM_PPU_SOCMEM_PID2_IMPLEMENTER_6_4_Pos 0UL
#define SOCMEM_PPU_SOCMEM_PID2_IMPLEMENTER_6_4_Msk 0x7UL
#define SOCMEM_PPU_SOCMEM_PID2_CONST_HIGH_Pos   3UL
#define SOCMEM_PPU_SOCMEM_PID2_CONST_HIGH_Msk   0x8UL
#define SOCMEM_PPU_SOCMEM_PID2_REV_CONST_Pos    4UL
#define SOCMEM_PPU_SOCMEM_PID2_REV_CONST_Msk    0xF0UL
/* SOCMEM_PPU_SOCMEM.PID3 */
#define SOCMEM_PPU_SOCMEM_PID3_PID3_REV_CONST_Pos 0UL
#define SOCMEM_PPU_SOCMEM_PID3_PID3_REV_CONST_Msk 0xFUL
#define SOCMEM_PPU_SOCMEM_PID3_PID3_REVISION_Pos 4UL
#define SOCMEM_PPU_SOCMEM_PID3_PID3_REVISION_Msk 0xF0UL
/* SOCMEM_PPU_SOCMEM.ID0 */
#define SOCMEM_PPU_SOCMEM_ID0_ID0_Pos           0UL
#define SOCMEM_PPU_SOCMEM_ID0_ID0_Msk           0xFFUL
/* SOCMEM_PPU_SOCMEM.ID1 */
#define SOCMEM_PPU_SOCMEM_ID1_ID1_Pos           0UL
#define SOCMEM_PPU_SOCMEM_ID1_ID1_Msk           0xFFUL
/* SOCMEM_PPU_SOCMEM.ID2 */
#define SOCMEM_PPU_SOCMEM_ID2_ID2_Pos           0UL
#define SOCMEM_PPU_SOCMEM_ID2_ID2_Msk           0xFFUL
/* SOCMEM_PPU_SOCMEM.ID3 */
#define SOCMEM_PPU_SOCMEM_ID3_ID3_Pos           0UL
#define SOCMEM_PPU_SOCMEM_ID3_ID3_Msk           0xFFUL


