PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_socmem.h
/* SOCMEM_SOCMEM_PD.CTL */
#define SOCMEM_SOCMEM_PD_CTL_BLEED_EN_Pos       0UL
#define SOCMEM_SOCMEM_PD_CTL_BLEED_EN_Msk       0x1UL
/* SOCMEM_SOCMEM_PD.PWR_UP_DELAY */
#define SOCMEM_SOCMEM_PD_PWR_UP_DELAY_COUNT_LOAD_Pos 0UL
#define SOCMEM_SOCMEM_PD_PWR_UP_DELAY_COUNT_LOAD_Msk 0xFFUL
#define SOCMEM_SOCMEM_PD_PWR_UP_DELAY_MEM_COUNT_LOAD_Pos 8UL
#define SOCMEM_SOCMEM_PD_PWR_UP_DELAY_MEM_COUNT_LOAD_Msk 0xFF00UL


/* SOCMEM.CTL */
#define SOCMEM_CTL_SRAM_WS_Pos                  0UL
#define SOCMEM_CTL_SRAM_WS_Msk                  0x3UL
#define SOCMEM_CTL_SROM_WS_Pos                  4UL
#define SOCMEM_CTL_SROM_WS_Msk                  0x30UL
#define SOCMEM_CTL_AUTO_GK_Pos                  16UL
#define SOCMEM_CTL_AUTO_GK_Msk                  0x10000UL
/* SOCMEM.STATUS */
#define SOCMEM_STATUS_WB_EMPTY_Pos              0UL
#define SOCMEM_STATUS_WB_EMPTY_Msk              0xFFFFUL
#define SOCMEM_STATUS_PORT_MPC_INIT_DONE_Pos    16UL
#define SOCMEM_STATUS_PORT_MPC_INIT_DONE_Msk    0x10000UL
/* SOCMEM.GK_CTL */
#define SOCMEM_GK_CTL_OPEN_Pos                  0UL
#define SOCMEM_GK_CTL_OPEN_Msk                  0xFFFFUL
/* SOCMEM.GK_STATUS */
#define SOCMEM_GK_STATUS_OPEN_Pos               0UL
#define SOCMEM_GK_STATUS_OPEN_Msk               0xFFFFUL
/* SOCMEM.ARB_DYN_CTL */
#define SOCMEM_ARB_DYN_CTL_CREDIT_Pos           0UL
#define SOCMEM_ARB_DYN_CTL_CREDIT_Msk           0x7FUL
#define SOCMEM_ARB_DYN_CTL_LATENCY_Pos          16UL
#define SOCMEM_ARB_DYN_CTL_LATENCY_Msk          0x10000UL
/* SOCMEM.MPC_READ_PORT_CTL */
#define SOCMEM_MPC_READ_PORT_CTL_INDEX_Pos      0UL
#define SOCMEM_MPC_READ_PORT_CTL_INDEX_Msk      0xFUL
/* SOCMEM.ECC_CTL */
#define SOCMEM_ECC_CTL_EN_Pos                   0UL
#define SOCMEM_ECC_CTL_EN_Msk                   0x1UL
#define SOCMEM_ECC_CTL_AUTO_CORRECT_Pos         1UL
#define SOCMEM_ECC_CTL_AUTO_CORRECT_Msk         0x2UL
#define SOCMEM_ECC_CTL_INJ_EN_Pos               2UL
#define SOCMEM_ECC_CTL_INJ_EN_Msk               0x4UL
#define SOCMEM_ECC_CTL_CHECK_EN_Pos             3UL
#define SOCMEM_ECC_CTL_CHECK_EN_Msk             0x8UL
#define SOCMEM_ECC_CTL_PARITY_Pos               16UL
#define SOCMEM_ECC_CTL_PARITY_Msk               0xFF0000UL
/* SOCMEM.ECC_MATCH */
#define SOCMEM_ECC_MATCH_WORD_ADDR_Pos          3UL
#define SOCMEM_ECC_MATCH_WORD_ADDR_Msk          0xFFFFF8UL
/* SOCMEM.WOUNDING */
#define SOCMEM_WOUNDING_WOUND_Pos               0UL
#define SOCMEM_WOUNDING_WOUND_Msk               0x7UL
/* SOCMEM.PWR_PARTITION_CTL */
#define SOCMEM_PWR_PARTITION_CTL_ACT_OFF_Pos    0UL
#define SOCMEM_PWR_PARTITION_CTL_ACT_OFF_Msk    0x3UL
#define SOCMEM_PWR_PARTITION_CTL_RET_OFF_Pos    8UL
#define SOCMEM_PWR_PARTITION_CTL_RET_OFF_Msk    0x300UL
/* SOCMEM.PWR_PARTITION_CTL_LOCK */
#define SOCMEM_PWR_PARTITION_CTL_LOCK_PWR_PARTITION_CTL_LOCK_Pos 0UL
#define SOCMEM_PWR_PARTITION_CTL_LOCK_PWR_PARTITION_CTL_LOCK_Msk 0x3UL
/* SOCMEM.PWR_DELAY_CTL */
#define SOCMEM_PWR_DELAY_CTL_UP_Pos             0UL
#define SOCMEM_PWR_DELAY_CTL_UP_Msk             0x3FFUL
#define SOCMEM_PWR_DELAY_CTL_SEQ0_DELAY_Pos     16UL
#define SOCMEM_PWR_DELAY_CTL_SEQ0_DELAY_Msk     0xFF0000UL
#define SOCMEM_PWR_DELAY_CTL_SEQ1_DELAY_Pos     24UL
#define SOCMEM_PWR_DELAY_CTL_SEQ1_DELAY_Msk     0xFF000000UL
/* SOCMEM.PWR_STATUS */
#define SOCMEM_PWR_STATUS_PWR_DONE_Pos          0UL
#define SOCMEM_PWR_STATUS_PWR_DONE_Msk          0x1UL


#endif /* _CYIP_SOCMEM_H_ */


/* [] END OF FILE */
